import { Gender, MedicalHistoryType, TreatmentStates } from "./types";

export interface User {
  name: string;
  email: string;
  isDoctor: boolean;
}

export const Doctor: User = {
  email: "admin@gmail.com",
  isDoctor: true,
  name: "Sarnai",
};

export const Nurse: User = {
  name: "Chimeg",
  email: "chimeg@gmail.com",
  isDoctor: false,
};

export interface Treatment {
  states: TreatmentStates;
  information: string;
  title: string;
}

export interface Inpatient {
  registerNo: string;
  firstname: string;
  lastname: string;
  age: number;
  gender: Gender;
  days: number;
  startOfPatient: Date;
  medicalHistory: MedicalHistoryType[];
  treatments: Array<
    Treatment & {
      startHour: string;
      endHour: string;
      roomNumber: number;
      date: Date;
    }
  >;
}

export const TreatmentList: Treatment[] = [
  {
    states: TreatmentStates.Pending,
    information:
      "Биеийг хоргүйжүүлэх эмчилгээ нь бодисын солилцооны үр дүнгээс биед үүссэн дотоод хор /эндотоксин/ болон гадаад очноос орж ирж буй хордлого /экзотоксин/-ыг тодорхой давтамжтай цахилгаан гүйдлээр гадагшлуудаг.",
    title: "Биеийг хоргүйжүүлэх  эмчилгээ",
  },
  {
    states: TreatmentStates.Pending,
    information:
      "Байгаль дахь дулааныг үүсгэж, хүний бие махбодид нэвтрэх чадвар сайтай, хоргүй, тодорхой урттай долгионоор үйлчилж, эмчлэн сэргээх чадвартай нарс модон, инфра улаан туяагаар халдаг мини саун юм. Энэхүү саунд орсноор хүний биеийн дархлаа сэргэж, чийрэгжин, эрүүлжин турах ач тустай бөгөөд инфра улаан туяаны долгион нь хүний биед 4 см хүртэл нэвтэрч орох чадвартай, ердийн саунтай харьцуулахад үйлчлэл нь зөөлөн, биеэс хорт бодисыг гадагшлуулах чадвар 4 дахин илүү юм.",
    title: "Infra red торхон мини саун",
  },
  {
    states: TreatmentStates.Pending,
    information:
      "Хүчилтөрөгчийг шууд хамраар өгөх, мөн коктель /холимог/-ийг хэрэглэхэд хялгасан судасны урсгал хурдасч, цусан дахь хүчилтөрөгч нэмэгдэж, цус хүчилтөрөгчөөр хангагдана. Хүчилтөрөгчийн архаг дутагдал, даралт ихсэх, амьсгал зүрх судасны өвчний үед хэрэглэнэ.Эмчилгээ болон урьдчилан сэргийлэх зорилгоор эсийн доторх хүчилтөрөгчийг нөхөх үйлдэл үзүүлнэ. Амьсгалаар орсон хүчилтөрөгч нь уушигны цулцангаар дамжин цусанд орж эд эсэд хүрнэ. Ингэснээр бодисын солилцооны дүнд үүссэн хүчилшлийн процессыг бууруулна. Артерийн даралтыг тогтвторжуулж, зүрхний булчингийн агшилтыг хэвийн болгоно.",
    title: "Хүчилтөрөгчийн эмчилгээ",
  },
  {
    states: TreatmentStates.Pending,
    information:
      "Аппаратын шахуургын тусламжаар үүсч буй  хийн даралт нь венийн болон лимфийн судсанд даралт үүсгэн “базаж суллах” хэлбэрийн үйлчлэл үзүүлснээр, тэдгээрийн урсгалыг түргэсгэн идэвхижүүлж, биед ялангуяа арьсан доор хуримтлагдсан илүүдэл шингэн хаванг арилгах, биеэс хорыг гадагшлуулах, усны тэнцвэрт байдлыг сэргээх, бодисын солилцоог идэвхжүүлэх, өөх, целлюлитийг задлах, булчин суллах, судас тэлж тэжээл бодисын солилцоог идэвхжүүлэх зэрэг эмчилгээний үйлдлийг үзүүлнэ. Даралтат эмчилгээний 1 удаагийн үйлчлэл нь нь гар массажны 10-12 удаагийн үйлчлэлтэй тэнцэхүйц нөлөө үзүүлж, үйлчлүүлэгчид сэтгэл зүйн таатай сэргэлт мэдрэмжийг төрүүлнэ",
    title: "Гар хөл биеийн даралтат эмчилгээ",
  },
  {
    states: TreatmentStates.Pending,
    information:
      "Хаш буюу ногоон чулуу нь Солонгос улсын эртний уламжлалт эмчилгээ юм. Энэ эмчилгээ нь эрүүл мэндийг сайжруулах болон өвчин эмгэгээс урьдчилан сэргийлнэ. Хаш чулуу халахаараа өөрөөсөө тодорхой долгионы урттай дулаан буюу нил улаан туяа ялгаруулж, үйлчлүүлэгчийн биеийн гүнд нэвтэрч өвдөлт намдаан, цусны эргэлтийг сайжруулж, стресс бухимдлыг багасган тайвшруулж булчингийн уян хатан байдлыг нэмэгдүүлдэг. Хаш чулууг халааж, ялгарч буй инфра туяагаар үйлчлэхээс гадна нурууны дагуу, рефлектор-сегментийн хэсгээр гулсуулан хөдөлгөх маягаар механик иллэг хийж, үйлчилнэ. Уг эмчилгээ нь нуруу, үе мөч, мэдрэл зүрх судас, дотор эрхтэний эмгэгт эмчилгээний эерэг үйлдэл үзүүлнэ.",
    title: "Хаш чулуун ор",
  },
  {
    states: TreatmentStates.Pending,
    information:
      "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
    title: "Хөдөлгөөн засал эмчилгээ",
  },
  {
    states: TreatmentStates.Pending,
    information:
      "Тодорхой хэмжээтэй механик хүчээр багана нурууны тодорхой хэсгийг газрын татах хүчний эсрэг чиглэлд татаж, булчинг суллах үндсэн үйлчилгээтэй. Энэ эмчилгээг хүзүү нурууны нугалмын үений суулт, ивэрхий, остеохондроз, хүзүү нурууны нугалам ясны радикулит, муруйлт, мөрний өвдөлт, зэрэг булчин чангарсан, дарагдлын хам шинж илэрсэн эмгэгийн үед эмчилгээний үр дүнтэй.",
    title: "Татлага эмчилгээ",
  },
];

export const Users: Inpatient[] = [
  {
    registerNo: "йй99999999",
    firstname: "Болд",
    lastname: "Бат",
    age: 24,
    gender: Gender.Male,
    days: 14,
    treatments: [
      {
        states: TreatmentStates.Done,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-24"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Cancel,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-24"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Done,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-25"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
    ],
    startOfPatient: new Date("2024-05-24"),
    medicalHistory: [],
  },
  {
    registerNo: "УА98240603",
    firstname: "Саран",
    lastname: "Гэрэл",
    age: 24,
    gender: Gender.Woman,
    days: 7,
    treatments: [
      {
        states: TreatmentStates.Done,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-22"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Cancel,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-24"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Done,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-25"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
    ],
    startOfPatient: new Date("2024-05-24"),
    medicalHistory: [],
  },
  {
    registerNo: "УА03240612",
    firstname: "Болд",
    lastname: "Бат",
    age: 24,
    gender: Gender.Male,
    days: 14,
    treatments: [],
    startOfPatient: new Date("2024-05-24"),
    medicalHistory: [],
  },
  {
    registerNo: "УА98240601",
    firstname: "Саран",
    lastname: "Гэрэл",
    age: 24,
    gender: Gender.Woman,
    days: 7,
    treatments: [
      {
        states: TreatmentStates.Done,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-20"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Cancel,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-24"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Done,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-25"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
    ],
    startOfPatient: new Date("2024-05-24"),
    medicalHistory: [],
  },
  {
    registerNo: "УА03240647",
    firstname: "Болд",
    lastname: "Бат",
    age: 24,
    gender: Gender.Male,
    days: 14,
    treatments: [
      {
        states: TreatmentStates.Pending,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-24"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Cancel,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-24"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Done,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-25"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
    ],
    startOfPatient: new Date("2024-05-24"),
    medicalHistory: [],
  },
  {
    registerNo: "УА98240643",
    firstname: "Саран",
    lastname: "Гэрэл",
    age: 24,
    gender: Gender.Woman,
    days: 7,
    treatments: [],
    startOfPatient: new Date("2024-05-24"),
    medicalHistory: [],
  },
  {
    registerNo: "УА03240312",
    firstname: "Болд",
    lastname: "Бат",
    age: 24,
    gender: Gender.Male,
    days: 14,
    treatments: [],
    startOfPatient: new Date("2024-05-24"),
    medicalHistory: [],
  },
  {
    registerNo: "УА98240123",
    firstname: "Саран",
    lastname: "Гэрэл",
    age: 24,
    gender: Gender.Woman,
    days: 7,
    treatments: [
      {
        states: TreatmentStates.Pending,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-24"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Cancel,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-24"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
      {
        states: TreatmentStates.Done,
        information:
          "Цус харвалт болон нуруу нугасны гэмтлийн дараах саа саажилтыг хөдөлгөөн заслаар эмчлэх нь өвчтөний өдөр тутмын үйл ажиллагаа, хөдөлгөөний чадварыг хамгийн боломжит дээд түвшинд хүргэх чадвар алдалтыг бууруулна. Хөдөлгөөн засал эмчилгээнд зориулалтын тусгай багаж хэрэгсэл хэрэглэнэ.",
        title: "Хөдөлгөөн засал эмчилгээ",
        date: new Date("2024-05-25"),
        endHour: "14-00",
        roomNumber: 103,
        startHour: "12-00",
      },
    ],
    startOfPatient: new Date("2024-05-24"),
    medicalHistory: [],
  },
];
